<a href="https://colab.research.google.com/github/Wodenken/hello-world/blob/master/Pandas_(loading_and_running).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# CSV database
import pandas as pd
import numpy as np
df = pd.read_csv("https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-analytics-bootcamp/nyc_baby_names.csv")
df.info()
df.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11345 entries, 0 to 11344
Data columns (total 12 columns):
Year of Birth           11345 non-null int64
Gender                  11345 non-null object
Ethnicity               11345 non-null object
Child's First Name      11345 non-null object
Count                   11345 non-null int64
Rank                    11345 non-null int64
Gender.1                11345 non-null object
Ethnicity.1             11345 non-null object
Child's First Name.1    11345 non-null object
Sub1                    11345 non-null object
Sub2                    11345 non-null object
Unnamed: 11             0 non-null float64
dtypes: float64(1), int64(3), object(8)
memory usage: 1.0+ MB

   Year of Birth  Gender  ...                        Sub2 Unnamed: 11
0           2011  FEMALE  ...  Asian And Pacific Islander         NaN
1           2011  FEMALE  ...  Asian And Pacific Islander         NaN
2           2011  FEMALE  ...  Asian And Pacific Islander         NaN

[3 rows x 12 columns]

In [0]:
# JSON database
df_2 = pd.read_json('https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-analytics-bootcamp/tweets.json')
df.info()
df.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11345 entries, 0 to 11344
Data columns (total 12 columns):
Year of Birth           11345 non-null int64
Gender                  11345 non-null object
Ethnicity               11345 non-null object
Child's First Name      11345 non-null object
Count                   11345 non-null int64
Rank                    11345 non-null int64
Gender.1                11345 non-null object
Ethnicity.1             11345 non-null object
Child's First Name.1    11345 non-null object
Sub1                    11345 non-null object
Sub2                    11345 non-null object
Unnamed: 11             0 non-null float64
dtypes: float64(1), int64(3), object(8)
memory usage: 1.0+ MB

       Year of Birth  Gender  ...                Sub2 Unnamed: 11
11342           2016  FEMALE  ...  Black Non Hispanic         NaN
11343           2016  FEMALE  ...  Black Non Hispanic         NaN
11344           2016  FEMALE  ...  Black Non Hispanic         NaN

[3 rows x 12 columns]